app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bob Lob Law"], ["text", "Enjoy the B Lob Law experience"], ["created_at", "2019-09-03 17:54:00.476794"], ["updated_at", "2019-09-03 17:54:00.476794"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy